{
  "timestamp": "2025-09-09T19:16:47.050755",
  "keywords": [
    "medical spa leesburg va",
    "botox ashburn",
    "aesthetics clinic virginia"
  ],
  "location": null,
  "searches": [
    {
      "keyword": "medical spa leesburg va",
      "query": "medical spa leesburg va",
      "ads_found": 1,
      "ads": [
        {
          "title": "Best Med Spa in Leesburg | Avie! Med Spa & Laser Center",
          "display_url": "https://aviemedspa.com",
          "description": "From body sculpting to skin rejuvenation to advanced injectables, we can help you on your beauty and wellness journey at the best med spa in Leesburg. | Specials & EventsMeet The TeamBotox in LeesburgUltherapy in Leesburg | Mediluxe Med Spa specializes in providing safe medical-grade treatments and wellness services to help you age gracefully and be the best version of ... | Prejuvenation Aesthetics is a state-of-the-art and luxurious med spa in Ashburn & Leesburg, VA, that believes in the power of preventative cosmetic treatments. | Top 10 Best Medical Spas Near Leesburg, Virginia · Hello Sugar VA Ashburn · Bitar Cosmetic Surgery Institute · Vital Drip Lounge · Vinod K Chopra, MD - Chopra ... | Vita Family Medicine & MedSpa - OPENING SOON! 540 Fort Evans Road, Suite 204,. Leesburg, VA,. USA. Hours. | Refined Aesthetics Sarah Safa, MS, PAC In Leesburg Virginia offers BOTOX, injectables, dermal fillers, laser treatments & peels, skincare, ... | The top-choice Medical Spa located in Leesburg VA treating various skin problems and providing laser hair removal treatments. | 19305 Winmeade Drive Leesburg, VA 20176 Directions Hours: Sunday & Monday: 9 am – 4 pm Tues, Wed, Thurs: 9 am – 8 pm Friday & Saturday: 9 am – 6 pm | Best Medspa in Northern Virginia Since 2018 Offering: Botox | Fillers | Facials | Chemical Peels | Laser Skin Rejuvenation | Body Contouring | IV Therapy | ... | 4.2(26)",
          "url": "https://aviemedspa.com/",
          "extensions": [
            "Specials & Events",
            "Meet The Team",
            "Botox in Leesburg",
            "Ultherapy in Leesburg"
          ],
          "position": "bottom"
        }
      ],
      "screenshot": "google_ads_live/search_medical_spa_leesburg_va_20250909_191652.png"
    },
    {
      "keyword": "botox ashburn",
      "query": "botox ashburn",
      "ads_found": 1,
      "ads": [
        {
          "title": "Botox and Fillers in Ashburn, VA",
          "display_url": "https://www.skinlabnova.com › Medical Spa Services",
          "description": "We provide a variety of injectable treatments including Botox® Cosmetic, dermal fillers, and PRF services. Schedule a consultation with us to discover which of ... | Voted Best of Ashburn, Mountcastle Medical Spa & Laser Center offers Botox, Daxxify, Dysport, Sculptra, and advanced laser treatments in Northern Virginia. | BOTOX® CosmeticBotoxMeet Our Medical DirectorMeet Our Providers | Our expert team of licensed medical professionals specializes in Botox ... 20931 Ashburn Rd, Suite 225 Ashburn, VA 20147 · 703-296-4730 · Privacy Policy. Where ... | Elle Aesthetic Arts and Plastic Surgery, specializes in Breast Surgery, Tummy Tuck, Facial Rejuvenation, injectable treatments and more in Northern Virginia ... | Refresh and rejuvenate your appearance with Botox treatments in Ashburn and Leesburg. Schedule a personalized consultation now. | Our Ashburn location features a full slate of services, including cosmetic surgery, non-surgical aesthetics, skin care, and dermatology, as well as our QUAD-A ... | BOTOX® CosmeticHydraFacial MD treatmentRead More TestimonialsMedSpa | Skip to content. Monday - Thursday, 10am - 6pm, Friday & Saturday, 9am - 3pm. 43490 Yukon Drive, Suite 103, Ashburn, VA 20147. Request an Appointment. Ashburn, ... | Our providers use BOTOX®, Dysport®, and DAXXIFY® to target dynamic wrinkles caused by repeated facial movements, such as forehead lines, frown lines, and crow's ... | Restylane® AshburnHydrafacial AshburnIV Therapy AshburnAbout | BOTOX Cosmetic is an anti-aging skin rejuvenation procedure at Mountcastle Medical Spa & Laser Center in Northern Virginia that treats facial wrinkles without ...",
          "url": "https://www.skinlabnova.com/medspa-services/injectable-treatments/",
          "extensions": [
            "BOTOX® Cosmetic",
            "Botox",
            "Meet Our Medical Director",
            "Meet Our Providers",
            "BOTOX® Cosmetic",
            "HydraFacial MD treatment",
            "Read More Testimonials",
            "MedSpa",
            "Restylane® Ashburn",
            "Hydrafacial Ashburn",
            "IV Therapy Ashburn",
            "About"
          ],
          "position": "bottom"
        }
      ],
      "screenshot": "google_ads_live/search_botox_ashburn_20250909_191700.png"
    },
    {
      "keyword": "aesthetics clinic virginia",
      "query": "aesthetics clinic virginia",
      "ads_found": 1,
      "ads": [
        {
          "title": "Medical Spa in Ashburn, VA | Amy Aesthetics & Wellness®",
          "display_url": "https://www.amyaesthetics.com",
          "description": "Visit our medical spa in Ashburn, VA for facials, acne care & anti-aging skin treatments. Reveal your best skin—book your skincare session today. | The Best Aesthetic Treatments in Northern Virginia. Call Us ... Faludi. Dr. Faludi, Aesthetic Medical Center, Tysons Corner, VA Dennis Faludi, M.D., FABOS | Signature Aesthetics, located in the charming, historic town of Clifton, Virginia, is a private, personalized medical clinic dedicated to facial aesthetics. | We are your cosmetic boutique medspa & elite aesthetic training center in Vienna, VA. Rejuvenation Clinic pairs the best and newest products with the most ... | At One U Aesthetics, a division of PMA Health, we're dedicated to offering the latest and most effective medical and aesthetic services to help you look and ... | Elle Aesthetic Arts and Plastic Surgery, specializes in Breast Surgery, Tummy Tuck, Facial Rejuvenation, injectable treatments and more in Northern Virginia ... | Washington Aesthetics & Medspa is a premier medspa in Fairfax, VA, offering a wide range of cosmetic treatments under one roof. | Look and feel your best with our extensive range of Cosmetic Services including Belotero, Botox, Chemical Peels, and a full line of Injections, Dermal Fillers ... | Meet Our TeamAll ServicesContactInsurance and Online Payment | Aesthetics Health is an award-winning beauty center located in McLean, Virginia. Known as the best permanent makeup, skincare, and laser service.",
          "url": "https://www.amyaesthetics.com/",
          "extensions": [
            "Meet Our Team",
            "All Services",
            "Contact",
            "Insurance and Online Payment"
          ],
          "position": "bottom"
        }
      ],
      "screenshot": "google_ads_live/search_aesthetics_clinic_virginia_20250909_191708.png"
    }
  ]
}